##输出
#python允许双等号，并且a跟c指向的是同一个内存（即a跟c两个指针指向同一个位置）
a=c=100
b=10

#c++风格的输出方式，但是由于python可以直接相连所以仅在需要指定格式输出时使用，其中%后面可以跟变量，需要加（）
print("%s年龄为%d" % ("kg",18))

#print函数内置分隔符为空格，可以通过在里面加入sep=“、”来修改分隔符
#结尾内置输出end（结束符），可以通过加入end=“假装换行”作为结尾，注意修改控制符之后不能再输出其他文字
#""内部是纯文本，不在“”内部全部直接输出，相当于cout，三引号可以输出换行字符串
print(a,a+b,90,"testing")
print("换行")

print("修改sep和end","修改后分隔符为/ 结束符为‘假装换行’",sep="/",end="假装换行")
print("这里是新一行")

#如果仅需要消除不同类型的数据输出时的空格，可以使用以下形式
print(f"a={a},b={b}")

#python允许输出时直接字符*n
print("-"*80+"这是分隔符")


##输入
#input函数后面的括号可以为空，也可以加上“”显示提示文字，读入的数据均以字符串变量保存
str1=input("请输入任意类型文字：")
#print函数内部的+表示连接两个字符串，只能连接字符串类型
print("你输入的文字是"+str1)

num=input("请输入一个数字：")
#强制类型转换在py中以函数形式出现，按照下面的做法可以将num转换为int类型，但必须保证转换数据的合法性
num=int(num)
print(num)

#eval函数可以去掉字符串的“”，相当于将字符串转化为其应有的数据类型，但如果输入本来就是字符串，则会报错
num2=eval(input("请输入一个数"))
print("这个数+3=",num2+3)
